#  数据转换

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data=pd.DataFrame({"food":["bob",'JOe',"will","BOb","JOe","WIll","bob"],"ounces":[4,3,12,6,7,8,8]})
data

   food  ounces
0   bob       4
1   JOe       3
2  will      12
3   BOb       6
4   JOe       7
5  WIll       8
6   bob       8

In [13]:
man_data={"bob":"pig","JOe":"pig","will":"dog","BOb":"cow","JOe":"duck","WIll":"sheep","bob":"horse"}
man_data

{'bob': 'horse', 'JOe': 'duck', 'will': 'dog', 'BOb': 'cow', 'WIll': 'sheep'}

In [14]:
lowercased=data["food"].str.lower()
lowercased

0     bob
1     joe
2    will
3     bob
4     joe
5    will
6     bob
Name: food, dtype: object

In [18]:
# map(function, iterable, ...)
data["animal"]=data["food"].map(man_data)  
#  map() 会根据提供的函数对指定序列做映射。第一个参数 function 以参数序列中的每一个元素调用 function 函数，返回包含每次 function 函数返回值的新列表。
data

   food  ounces animal
0   bob       4  horse
1   JOe       3   duck
2  will      12    dog
3   BOb       6    cow
4   JOe       7   duck
5  WIll       8  sheep
6   bob       8  horse

In [22]:
data["food"].replace("bob",np.nan)

0     NaN
1     JOe
2    will
3     BOb
4     JOe
5    WIll
6     NaN
Name: food, dtype: object

In [27]:
data["food"].str.replace("b","np.nan")# data.str. replace是对字符串进行按元素替代的。

0    np.nanonp.nan
1              JOe
2             will
3         BOnp.nan
4              JOe
5             WIll
6    np.nanonp.nan
Name: food, dtype: object

#  重命名轴索引

In [32]:
dara=pd.DataFrame(np.arange(12).reshape(3,4),index=["biob","mmm","uuu"],columns=["name","sex","old","school"]
            )
dara

      name  sex  old  school
biob     0    1    2       3
mmm      4    5    6       7
uuu      8    9   10      11

In [33]:
transdorem=lambda x:x[:4].upper()  ##lambda [arg1 [, agr2,.....argn]] : expression

In [37]:
dara.index.map(transdorem)

Index(['BIOB', 'MMM', 'UUU'], dtype='object')

In [38]:
dara

      name  sex  old  school
biob     0    1    2       3
mmm      4    5    6       7
uuu      8    9   10      11

In [40]:
dara.index=dara.index.map(transdorem)
dara

      name  sex  old  school
BIOB     0    1    2       3
MMM      4    5    6       7
UUU      8    9   10      11

# 离散化和分箱

In [49]:
ages=np.random.randint(20,60,12)
ages

array([51, 41, 24, 57, 35, 33, 29, 21, 37, 57, 56, 41])

In [59]:
bind=[20,35,40,60]

In [60]:
cats=pd.cut(ages,bins=bind)
cats             ## 输出为每个值所在的区域

[(40, 60], (40, 60], (20, 35], (40, 60], (20, 35], ..., (20, 35], (35, 40], (40, 60], (40, 60], (40, 60]]
Length: 12
Categories (3, interval[int64]): [(20, 35] < (35, 40] < (40, 60]]

In [61]:
cats.codes

array([2, 2, 0, 2, 0, 0, 0, 0, 1, 2, 2, 2], dtype=int8)

In [62]:
cats.categories

IntervalIndex([(20, 35], (35, 40], (40, 60]],
              closed='right',
              dtype='interval[int64]')

In [63]:
cats.value_counts()

(20, 35]    5
(35, 40]    1
(40, 60]    6
dtype: int64

# 检测和过滤异常值

In [96]:
dat=pd.DataFrame(np.random.randn(1000,4))   ##  参数是指生成数据的结构，非标准差之类的数。
dat

            0         1         2         3
0   -1.838992  2.437586 -0.040874  0.333453
1   -0.478172  1.967148  0.482035  0.072862
2   -0.594965  0.871294  0.680928  0.377054
3    2.703539 -1.525459 -2.380050  0.362732
4    0.422336  1.796818  1.343442 -0.006039
..        ...       ...       ...       ...
995 -2.807957 -0.076488 -1.276490 -0.579878
996 -0.507839 -0.016561 -0.789907 -0.815691
997  1.589117 -1.920261 -0.532031 -0.058585
998  2.589798 -0.190727 -0.295559 -1.952831
999 -0.068730 -1.431971  0.279196  0.499827

[1000 rows x 4 columns]

In [97]:
dat.describe(percentiles=[0.2,0.6])    #  参数是指几分位数

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024693     0.062612    -0.012508    -0.034475
std       0.992596     1.017690     1.010551     0.978895
min      -4.039316    -3.106504    -2.880727    -3.450911
20%      -0.870170    -0.817971    -0.853773    -0.844999
50%      -0.057459     0.084543    -0.041955    -0.006917
60%       0.201085     0.329774     0.181726     0.215397
max       3.421644     4.431578     3.617800     3.151657

In [98]:
col=dat[2]
col

0     -0.040874
1      0.482035
2      0.680928
3     -2.380050
4      1.343442
         ...
995   -1.276490
996   -0.789907
997   -0.532031
998   -0.295559
999    0.279196
Name: 2, Length: 1000, dtype: float64

In [99]:
col[np.abs(col)>3]

132    3.038465
678    3.234692
980    3.617800
Name: 2, dtype: float64

In [100]:
np.sign(dat)*3   # 语句np.sign(data)根据数据中的值的正负分别生成1和-1的数值：

       0    1    2    3
0   -3.0  3.0 -3.0  3.0
1   -3.0  3.0  3.0  3.0
2   -3.0  3.0  3.0  3.0
3    3.0 -3.0 -3.0  3.0
4    3.0  3.0  3.0 -3.0
..   ...  ...  ...  ...
995 -3.0 -3.0 -3.0 -3.0
996 -3.0 -3.0 -3.0 -3.0
997  3.0 -3.0 -3.0 -3.0
998  3.0 -3.0 -3.0 -3.0
999 -3.0 -3.0  3.0  3.0

[1000 rows x 4 columns]

In [95]:
np.abs(dat)>3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [110]:
dat[np.abs(dat)>3]=np.sign(dat)*3       # 将绝对值大于3的数值改为3.dat改变（在原有的基础上改变），不生成新数据。
dat.describe(percentiles=[0.2,0.6])

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024567     0.060929    -0.013399    -0.034107
std       0.985969     1.011129     1.007671     0.976728
min      -3.000000    -3.000000    -2.880727    -3.000000
20%      -0.870170    -0.817971    -0.853773    -0.844999
50%      -0.057459     0.084543    -0.041955    -0.006917
60%       0.201085     0.329774     0.181726     0.215397
max       3.000000     3.000000     3.000000     3.000000

In [111]:
dat[(np.abs(dat)>=3).any(1)]

            0         1         2         3
132  0.761441  1.362445  3.000000 -0.049931
200  0.303094  1.789685 -1.406858 -3.000000
223 -1.013862  3.000000  0.852088 -0.418034
258 -2.947997  3.000000  0.556916 -0.604521
276 -0.221929 -0.648208  0.965565  3.000000
399  0.421332  3.000000 -1.557137 -0.813923
576 -0.079042  3.000000 -0.552743  0.551447
627  2.013737 -3.000000  0.616891  0.866596
640  3.000000 -0.069307 -0.326397 -0.449201
678  0.049052  2.133025  3.000000  0.248179
763  3.000000 -0.320286  2.502458 -0.899931
797 -3.000000 -0.425507  1.060942  0.957964
873  3.000000  0.136478 -1.374591 -1.178395
887  1.241312  0.684796  0.279411 -3.000000
980  0.478288  0.062372  3.000000 -0.984718

In [113]:
dat[2][132]

3.0

# 置换和随机取样

In [115]:
da=pd.DataFrame(np.arange(5*4).reshape(5,4))
da

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [135]:
# 法1

In [134]:
sampl=[4,3,0,1,2]   # 样本的排列顺序（指定顺序）
da.take(sampl)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11

In [136]:
# 法2

In [137]:
sample1=np.random.permutation(5)   # 随机生成排列顺序
sample1
da.take(sample1)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [138]:
# 法3

In [139]:
da.sample(n=5)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [143]:
# 允许重复出现
da.sample(n=10,replace=True)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3